//
//  main.c
//  原码补码反码
//
//  Created by 紫川秀 on 2022/4/28.
/*
 数据在计算机中是以补码的形式存储的
 数据分为有符号和无符号：无符号数都是正数
    正数：反码==补码==原码
    负数：反码==除符号位以外的各位去反，补码==反码+1
 正数的首位地址为0，负数是1
 8位下：
 +1 == 0000 0001（原码） == 0000 0001（反码） == 0000 0001（补码）
 -1 == 1000 0001（原码） == 1111 1110（反码） == 1111 1111（补码）
 64位下：int站4个字节，每个字节站8位
 +1 == 0000 0000 0000 0000 0000 0000 0000 0001（原码，补码，反码都相同）
 -1 == 1000 0000 0000 0000 0000 0000 0000 0001(原码) == 1111 1111 1111 1111 1111 1111 1111 1110（反码） == 1111 1111 1111 1111 1111 1111 1111 1111（补码）
 */

#include <stdio.h>

int main(int argc, const char * argv[]) {
    int a = 0b00000000000000000000000000000001;
    printf("%d\n",a);
//    10000000000000000000000000000001在计算机中是补码的形式 存储的
    int b = 0b11111111111111111111111111111111;
    printf("%d\n",b);
    return 0;
}
