//
//  main.c
//  位运算符
//
//  Created by 紫川秀 on 2022/4/28.
/*
 位运算是指二进制进行的运算
 C语言提供了6个位操作运算符，这些运算符只能用于整型操作数，即只能用于带符号和无符号的char,short,int和long类型
    &按位与
    |按位或
    ~按位取反
    ^按位异或
    <<左移位
    >>右移位
 */

#include <stdio.h>

int main(int argc, const char * argv[]) {
/*
 &按位与:同1为1，有0为0
  0000 1001
& 0000 1000
 ----------------
  0000 1000
 */
    int a = 13&8;
    printf("&==%d\n",a);
/*
 |按位或:有1为1，同0为0
  0000 1001
| 0000 1000
 ----------------
  0000 1001
*/
    int b = 9|8;
    printf("|==%d\n",b);
/*
 ~按位取反:1变0,0变1
  0000 1001
 ~
 ----------------
  1111 0110
*/
    int c = ~9;
    printf("~==%d\n",c);
/*
 ^按位异或:相同为0，不同为1
  0000 1001
 ^0000 1000
 ----------------
  0000 0001
*/
    int d = 9^8;
    printf("^==%d\n",d);
/*
 <<左移位:高位丢弃，低位补0,相当于原数*2^n
 0000 1001
 <<2
 ----------------
 0000 0100
 注意：可能会改变1个数的正负性
*/
    int e = 8<<2;
    printf("<<==%d\n",e);
/*
 >>右移位:低位丢弃，高位补符号位,相当于原数/2^n
 0000 1001
 >>2
 ----------------
 0000 0010
 注意：不会改变1个数的正负性
*/
    int f = 8>>2;
    printf(">>==%d\n",f);
    return 0;
}
